
## Plan Result (terraform)

[CI link](https://github.com/Taiki130/ecsexec/actions/runs/9232767662)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * github_actions_secret.secrets[&#34;GORELEASER_APP_ID&#34;]
  * github_actions_secret.secrets[&#34;GORELEASER_APP_PRIVATE_KEY&#34;]
* Delete
  * github_actions_secret.secrets[&#34;APP_PRIVATE_KEY&#34;]
  * github_actions_variable.main[&#34;APP_ID&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_secret.secrets["APP_PRIVATE_KEY"] will be destroyed
  # (because key ["APP_PRIVATE_KEY"] is not in for_each map)
  - resource "github_actions_secret" "secrets" {
      - created_at      = "2024-04-08 11:18:52 +0000 UTC" -> null
      - id              = "ecsexec:APP_PRIVATE_KEY" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "ecsexec" -> null
      - secret_name     = "APP_PRIVATE_KEY" -> null
      - updated_at      = "2024-04-08 11:59:54 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

  # github_actions_secret.secrets["GORELEASER_APP_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "ecsexec"
      + secret_name     = "GORELEASER_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["GORELEASER_APP_PRIVATE_KEY"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "ecsexec"
      + secret_name     = "GORELEASER_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_variable.main["APP_ID"] will be destroyed
  # (because github_actions_variable.main is not in configuration)
  - resource "github_actions_variable" "main" {
      - created_at    = "2024-04-08 11:18:50 +0000 UTC" -> null
      - id            = "ecsexec:APP_ID" -> null
      - repository    = "ecsexec" -> null
      - updated_at    = "2024-04-08 11:18:50 +0000 UTC" -> null
      - value         = "872203" -> null
      - variable_name = "APP_ID" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":161,"Program":"tfcmt","SHA1":"4774dcb476a250964ed9e16de46b53896e6b2385","Target":"terraform","Vars":{},"WorkflowName":"pull_request_target"} -->